const events = [
  { date: "2024-09-15", day: "الاحد", name: "عيد المولد النبوي الشريف (تقديراً)" },
  { date: "2024-10-06", day: "الاحد", name: "بدء العام الجامعي 2025/2024 وبدء دوام أعضاء هيئة التدريس" },
  { date: "2024-10-06", day: "الاحد", name: "الفترة الثانية للإرشاد والتسجيل والانسحاب والإضافة لمواد الفصل الأول 2025/2024" },
  { date: "2024-10-13", day: "الاحد", name: "بدء الدراسة في الفصل الأول 2025/2024 (الأسبوع 1)" },
  { date: "2024-10-13", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الأولى (50 دينار)" },
  { date: "2024-10-17", day: "الخميس", name: "انتهاء فترة الانسحاب والإضافة للفصل الأول 2025/2024" },
  { date: "2024-10-20", day: "الاحد", name: "الأسبوع 2" },
  { date: "2024-10-20", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الثانية (100 دينار)" },
  { date: "2024-10-27", day: "الاحد", name: "الأسبوع 3" },
  { date: "2024-11-03", day: "الاحد", name: "الأسبوع 4" },
  { date: "2024-11-10", day: "الاحد", name: "الأسبوع 5" },
  { date: "2024-11-17", day: "الاحد", name: "الأسبوع 6" },
  { date: "2024-11-24", day: "الاحد", name: "الأسبوع 7" },
  { date: "2024-12-01", day: "الاحد", name: "الأسبوع 8" },
  { date: "2024-12-01", day: "الاحد", name: "بدء التسجيل على مواد الفصل الثاني 2025/2024" },
  { date: "2024-12-01", day: "الاحد", name: "فترة الامتحانات الفصلية للفصل الأول 2025/2024" },
  { date: "2024-12-08", day: "الاحد", name: "الأسبوع 9" },
  { date: "2024-12-15", day: "الاحد", name: "الأسبوع 10" },
  { date: "2024-12-16", day: "الاثنين", name: "الامتحان الشامل (الجلسة الأولى)" },
  { date: "2024-12-18", day: "الاربعاء", name: "الامتحان الشامل (الجلسة الثانية)" },
  { date: "2024-12-22", day: "الاحد", name: "الأسبوع 11" },
  { date: "2024-12-25", day: "الاربعاء", name: "عيد الميلاد المجيد" },
  { date: "2024-12-29", day: "الاحد", name: "الأسبوع 12" },
  { date: "2025-01-01", day: "الاربعاء", name: "رأس السنة الميلادية" },
  { date: "2025-01-05", day: "الاحد", name: "الأسبوع 13" },
  { date: "2025-01-12", day: "الاحد", name: "الأسبوع 14" },
  { date: "2025-01-16", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الأول 2025/2024" },
  { date: "2025-01-19", day: "الاحد", name: "الأسبوع 15" },
  { date: "2025-01-26", day: "الاحد", name: "فترة الامتحانات النهائية للفصل الأول 2025/2024" },
  { date: "2025-01-28", day: "الثلاثاء", name: "عيد الإسراء والمعراج الشريف (بدون تعطيل)" },
  { date: "2025-01-30", day: "الخميس", name: "عيد ميلاد جلالة الملك عبدالله الثاني المعظم (بدون تعطيل)" },
  { date: "2025-02-06", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2025-02-09", day: "الاحد", name: "بدء إجازة الطلبة" },
  { date: "2025-02-09", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الأول 2025/2024" },
  { date: "2025-02-16", day: "الاحد", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الأول 2025/2024" },
  { date: "2025-02-16", day: "الاحد", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا" },
  { date: "2025-02-19", day: "الاربعاء", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الأول 2025/2024" },
  { date: "2025-02-23", day: "الاحد", name: "الفترة الثانية للإرشاد والتسجيل والانسحاب والإضافة لمواد الفصل الثاني 2025/2024" },
  { date: "2025-03-02", day: "الاحد", name: "بدء الدراسة في الفصل الثاني 2025/2024 (الأسبوع 1)" },
  { date: "2025-03-02", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الأولى (50 دينار)" },
  { date: "2025-03-06", day: "الخميس", name: "انتهاء فترة الانسحاب والإضافة للفصل الثاني 2025/2024" },
  { date: "2025-03-09", day: "الاحد", name: "الأسبوع 2" },
  { date: "2025-03-09", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الثانية (100 دينار)" },
  { date: "2025-03-16", day: "الاحد", name: "الأسبوع 3" },
  { date: "2025-03-23", day: "الاحد", name: "الأسبوع 4" },
  { date: "2025-03-30", day: "الاحد", name: "الأسبوع 5" },
  { date: "2025-03-30", day: "الاحد", name: "عيد الفطر المبارك (تقديراً)" },
  { date: "2025-04-06", day: "الاحد", name: "الأسبوع 6" },
  { date: "2025-04-13", day: "الاحد", name: "الأسبوع 7" },
  { date: "2025-04-20", day: "الاحد", name: "الأسبوع 8" },
  { date: "2025-04-20", day: "الاحد", name: "بدء التسجيل على مواد الفصل الصيفي 2025/2024" },
  { date: "2025-04-27", day: "الاحد", name: "الأسبوع 9" },
  { date: "2025-04-27", day: "الاحد", name: "فترة الامتحانات الفصلية لمواد الفصل الثاني 2025/2024" },
  { date: "2025-04-28", day: "الاثنين", name: "الامتحان الشامل (الجلسة الأولى)" },
  { date: "2025-04-30", day: "الاربعاء", name: "الامتحان الشامل (الجلسة الثانية)" },
  { date: "2025-05-01", day: "الخميس", name: "عيد العمال" },
  { date: "2025-05-04", day: "الاحد", name: "الأسبوع 10" },
  { date: "2025-05-11", day: "الاحد", name: "الأسبوع 11" },
  { date: "2025-05-18", day: "الاحد", name: "الأسبوع 12" },
  { date: "2025-05-25", day: "الاحد", name: "الأسبوع 13" },
  { date: "2025-05-25", day: "الاحد", name: "عيد الاستقلال" },
  { date: "2025-06-01", day: "الاحد", name: "الأسبوع 14" },
  { date: "2025-06-05", day: "الخميس", name: "عطلة عيد الأضحى المبارك (تقديراً)" },
  { date: "2025-06-08", day: "الاحد", name: "الأسبوع 15" },
  { date: "2025-06-09", day: "الاثنين", name: "عيد جلوس جلالة الملك عبدالله الثاني المعظم (بدون تعطيل)" },
  { date: "2025-06-10", day: "الثلاثاء", name: "عيد الجيش والثورة العربية الكبرى (بدون تعطيل)" },
  { date: "2025-06-12", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الثاني 2025/2024" },
  { date: "2025-06-15", day: "الاحد", name: "الأسبوع 16" },
  { date: "2025-06-21", day: "السبت", name: "فترة الامتحانات النهائية للفصل الثاني 2025/2024" },
  { date: "2025-06-27", day: "الجمعة", name: "رأس السنة الهجرية (تقديراً)" },
  { date: "2025-07-03", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2025-07-06", day: "الاحد", name: "بدء إجازة الطلبة" },
  { date: "2025-07-06", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الثاني 2025/2024" },
  { date: "2025-07-10", day: "الخميس", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا" },
  { date: "2025-07-10", day: "الخميس", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الثاني 2025/2024" },
  { date: "2025-07-14", day: "الاثنين", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير للطلبة الخريجين للفصل الثاني 2025/2024" },
  { date: "2025-07-16", day: "الاربعاء", name: "حفلات التخرج" },
  { date: "2025-07-20", day: "الاحد", name: "بدء الدراسة في الفصل الصيفي 2025/2024 (الأسبوع 1)" },
  { date: "2025-07-22", day: "الثلاثاء", name: "انتهاء فترة الانسحاب والإضافة للفصل الصيفي 2025/2024" },
  { date: "2025-07-27", day: "الاحد", name: "الأسبوع 2" },
  { date: "2025-08-03", day: "الاحد", name: "الأسبوع 3" },
  { date: "2025-08-03", day: "الاحد", name: "بدء التسجيل على مواد الفصل الأول 2026/2025" },
  { date: "2025-08-10", day: "الاحد", name: "الأسبوع 4" },
  { date: "2025-08-17", day: "الاحد", name: "الأسبوع 5" },
  { date: "2025-08-17", day: "الاحد", name: "فترة الامتحانات الفصلية للفصل الصيفي 2025/2024" },
  { date: "2025-08-24", day: "الاحد", name: "الأسبوع 6" },
  { date: "2025-08-28", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الصيفي 2025/2024" },
  { date: "2025-08-31", day: "الاحد", name: "الأسبوع 7" },
  { date: "2025-09-07", day: "الاحد", name: "الأسبوع 8" },
  { date: "2025-09-08", day: "الاثنين", name: "فترة الامتحانات النهائية للفصل الصيفي 2025/2024" },
  { date: "2025-09-11", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2025-09-14", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الصيفي 2025/2024" },
  { date: "2025-09-18", day: "الخميس", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الصيفي 2025/2024" },
  { date: "2025-09-18", day: "الخميس", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا والبحث العلمي" },
  { date: "2025-09-22", day: "الاثنين", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين على الفصل الصيفي 2025/2024" },
  { date: "2025-10-05", day: "الاحد", name: "بدء العام الجامعي وبدء دوام أعضاء هيئة التدريس" },
  { date: "2025-10-12", day: "الاحد", name: "بدء الدراسة في الفصل الأول 2026/2025 (الأسبوع 1)" },
];

const eventsBody = document.getElementById("events-body");

function updateCountdown(row, event) {
  const now = new Date();
  const eventDate = new Date(event.date);
  const timeDifference = eventDate - now;

  if (timeDifference <= 0) {
    row.querySelector(".countdown").textContent = "الوقت قد حان!";
    return;
  }

  const days = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
  const hours = Math.floor((timeDifference % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));
  const minutes = Math.floor((timeDifference % (1000 * 60 * 60)) / (1000 * 60));
  const seconds = Math.floor((timeDifference % (1000 * 60)) / 1000);

  row.querySelector(".countdown").textContent = `${days} يوم ${hours} ساعة ${minutes} دقيقة ${seconds} ثانية`;
}

function initialize() {
  events.forEach(event => {
    const row = document.createElement("tr");
    row.innerHTML = `
      <td>${event.date}</td>
      <td>${event.day}</td>
      <td>${event.name}</td>
      <td class="countdown">--:--:--</td>
    `;
    eventsBody.appendChild(row);

    setInterval(() => updateCountdown(row, event), 1000);
  });
}

initialize();