const events = [
  { date: "2025-10-05", day: "الاحد", name: "بدء العام الجامعي وبدء دوام أعضاء هيئة التدريس" },
  { date: "2025-10-05", day: "الاحد", name: "الفترة الثانية للإرشاد والتسجيل والانسحاب والإضافة لمواد الفصل الأول 2025/2026" },
  { date: "2025-10-12", day: "الاحد", name: "بدء الدراسة في الفصل الأول 2025/2026 (الأسبوع 1)" },
  { date: "2025-10-12", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الأولى (50 دينار)" },
  { date: "2025-10-16", day: "الخميس", name: "انتهاء فترة الانسحاب والإضافة للفصل الأول 2025/2026" },
  { date: "2025-10-19", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الثانية (100 دينار)" },
  { date: "2025-10-19", day: "الاحد", name: "الأسبوع 2" },
  { date: "2025-10-26", day: "الاحد", name: "الأسبوع 3" },
  { date: "2025-11-02", day: "الاحد", name: "الأسبوع 4" },
  { date: "2025-11-09", day: "الاحد", name: "الأسبوع 5" },
  { date: "2025-11-16", day: "الاحد", name: "الأسبوع 6" },
  { date: "2025-11-23", day: "الاحد", name: "الأسبوع 7" },
  { date: "2025-11-30", day: "الاحد", name: "فترة الامتحانات الفصلية للفصل الأول 2025/2026" },
  { date: "2025-12-07", day: "الاحد", name: "بدء التسجيل على مواد الفصل الثاني 2025/2026" },
  { date: "2025-12-07", day: "الاحد", name: "الأسبوع 8" },
  { date: "2025-12-15", day: "الاثنين", name: "الامتحان الشامل (الجلسة الأولى)" },
  { date: "2025-12-17", day: "الاربعاء", name: "الامتحان الشامل (الجلسة الثانية)" },
  { date: "2025-12-21", day: "الاحد", name: "الأسبوع 9" },
  { date: "2025-12-25", day: "الخميس", name: "عيد الميلاد المجيد" },
  { date: "2025-12-28", day: "الاحد", name: "الأسبوع 10" },
  { date: "2026-01-01", day: "الخميس", name: "رأس السنة الميلادية" },
  { date: "2026-01-04", day: "الاحد", name: "الأسبوع 11" },
  { date: "2026-01-11", day: "الاحد", name: "الأسبوع 12" },
  { date: "2026-01-15", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الأول 2025/2026" },
  { date: "2026-01-18", day: "الاحد", name: "الأسبوع 13" },
  { date: "2026-01-22", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2026-01-24", day: "السبت", name: "فترة الامتحانات النهائية للفصل الأول 2025/2026" },
  { date: "2026-01-28", day: "الاربعاء", name: "عيد الإسراء والمعراج الشريف (بدون تعطيل)" },
  { date: "2026-01-30", day: "الجمعة", name: "عيد ميلاد جلالة الملك عبدالله الثاني المعظم (بدون تعطيل)" },
  { date: "2026-02-08", day: "الاحد", name: "بدء إجازة الطلبة" },
  { date: "2026-02-08", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الأول 2025/2026" },
  { date: "2026-02-15", day: "الاحد", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الأول 2025/2026" },
  { date: "2026-02-15", day: "الاحد", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا" },
  { date: "2026-02-18", day: "الاربعاء", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الأول 2025/2026" },

  // الفصل الثاني
  { date: "2026-02-22", day: "الاحد", name: "الفترة الثانية للإرشاد والتسجيل والانسحاب والإضافة لمواد الفصل الثاني 2025/2026" },
  { date: "2026-03-01", day: "الاحد", name: "بدء الدراسة في الفصل الثاني 2025/2026 (الأسبوع 1)" },
  { date: "2026-03-01", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الأولى (50 دينار)" },
  { date: "2026-03-05", day: "الخميس", name: "انتهاء فترة الانسحاب والإضافة للفصل الثاني 2025/2026" },
  { date: "2026-03-08", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الثانية (100 دينار)" },
  { date: "2026-03-08", day: "الاحد", name: "الأسبوع 2" },
  { date: "2026-03-15", day: "الاحد", name: "الأسبوع 3" },
  { date: "2026-03-22", day: "الاحد", name: "الأسبوع 4" },
  { date: "2026-03-29", day: "الاحد", name: "الأسبوع 5" },
  { date: "2026-04-05", day: "الاحد", name: "الأسبوع 6" },
  { date: "2026-04-12", day: "الاحد", name: "الأسبوع 7" },
  { date: "2026-04-19", day: "الاحد", name: "بدء التسجيل على مواد الفصل الصيفي 2025/2026" },
  { date: "2026-04-19", day: "الاحد", name: "الأسبوع 8" },
  { date: "2026-04-26", day: "الاحد", name: "فترة الامتحانات الفصلية لمواد الفصل الثاني 2025/2026" },
  { date: "2026-04-27", day: "الاثنين", name: "الامتحان الشامل (الجلسة الأولى)" },
  { date: "2026-04-29", day: "الاربعاء", name: "الامتحان الشامل (الجلسة الثانية)" },
  { date: "2026-05-03", day: "الاحد", name: "الأسبوع 9" },
  { date: "2026-05-10", day: "الاحد", name: "الأسبوع 10" },
  { date: "2026-05-17", day: "الاحد", name: "الأسبوع 11" },
  { date: "2026-05-24", day: "الاحد", name: "الأسبوع 12" },
  { date: "2026-05-25", day: "الاثنين", name: "عيد الاستقلال" },
  { date: "2026-05-26", day: "الثلاثاء", name: "عطلة عيد الأضحى المبارك (تقديراً)" },
  { date: "2026-05-31", day: "الاحد", name: "الأسبوع 13" },
  { date: "2026-06-07", day: "الاحد", name: "الأسبوع 14" },
  { date: "2026-06-09", day: "الثلاثاء", name: "عيد جلوس جلالة الملك عبدالله الثاني المعظم (بدون تعطيل)" },
  { date: "2026-06-10", day: "الاربعاء", name: "عيد الجيش والثورة العربية الكبرى (بدون تعطيل)" },
  { date: "2026-06-11", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الثاني 2025/2026" },
  { date: "2026-06-16", day: "الثلاثاء", name: "رأس السنة الهجرية (تقديراً)" },
  { date: "2026-06-18", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2026-06-20", day: "السبت", name: "فترة الامتحانات النهائية للفصل الثاني 2025/2026" },
  { date: "2026-07-05", day: "الاحد", name: "بدء إجازة الطلبة" },
  { date: "2026-07-05", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الثاني 2025/2026" },
  { date: "2026-07-09", day: "الخميس", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا" },
  { date: "2026-07-09", day: "الخميس", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الثاني 2025/2026" },
  { date: "2026-07-13", day: "الاثنين", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير للطلبة الخريجين للفصل الثاني 2025/2026" },

  // الفصل الصيفي
  { date: "2026-07-12", day: "الاحد", name: "الفترة الثانية للإرشاد والتسجيل والانسحاب والإضافة لمواد الفصل الصيفي 2025/2026" },
  { date: "2026-07-19", day: "الاحد", name: "بدء الدراسة في الفصل الصيفي 2025/2026 (الأسبوع 1)" },
  { date: "2026-07-19", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الأولى (50 دينار)" },
  { date: "2026-07-21", day: "الثلاثاء", name: "انتهاء فترة الانسحاب والإضافة للفصل الصيفي 2025/2026" },
  { date: "2026-07-26", day: "الاحد", name: "غرامة التسجيل المتأخر للطلبة القدامى الفترة الثانية (100 دينار)" },
  { date: "2026-07-26", day: "الاحد", name: "الأسبوع 2" },
  { date: "2026-08-02", day: "الاحد", name: "بدء التسجيل على مواد الفصل الأول 2026/2027" },
  { date: "2026-08-02", day: "الاحد", name: "الأسبوع 3" },
  { date: "2026-08-09", day: "الاحد", name: "الأسبوع 4" },
  { date: "2026-08-16", day: "الاحد", name: "فترة الامتحانات الفصلية للفصل الصيفي 2025/2026" },
  { date: "2026-08-23", day: "الاحد", name: "الأسبوع 5" },
  { date: "2026-08-27", day: "الخميس", name: "انتهاء فترة الانسحاب من مواد الفصل الصيفي 2025/2026" },
  { date: "2026-08-30", day: "الاحد", name: "الأسبوع 6" },
  { date: "2026-09-03", day: "الخميس", name: "آخر موعد لمناقشة رسائل الماجستير" },
  { date: "2026-09-07", day: "الاثنين", name: "فترة الامتحانات النهائية للفصل الصيفي 2025/2026" },
  { date: "2026-09-13", day: "الاحد", name: "آخر موعد لتقديم نتائج الفصل الصيفي 2025/2026" },
  { date: "2026-09-17", day: "الخميس", name: "آخر موعد لتقديم تنسيبات مجالس الكليات منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين في الفصل الصيفي 2025/2026" },
  { date: "2026-09-17", day: "الخميس", name: "آخر موعد لتسليم رسائل الماجستير لعمادة الدراسات العليا والبحث العلمي" },
  { date: "2026-09-21", day: "الاثنين", name: "قرار مجلس العمداء منح درجة البكالوريوس أو الماجستير والدبلوم للطلبة الخريجين على الفصل الصيفي 2025/2026" },

  // الفصل الأول 2026/2027
  { date: "2026-10-04", day: "الاحد", name: "بدء العام الجامعي وبدء دوام أعضاء هيئة التدريس" },
  { date: "2026-10-11", day: "الاحد", name: "بدء الدراسة في الفصل الأول 2026/2027 (الأسبوع 1)" },
];

const eventsBody = document.getElementById("events-body");

function updateCountdown(row, event) {
  const now = new Date();
  const eventDate = new Date(event.date);
  const timeDifference = eventDate - now;

  if (timeDifference <= 0) {
    row.querySelector(".countdown").textContent = "الوقت قد حان!";
    return;
  }

  const days = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
  const hours = Math.floor((timeDifference % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));
  const minutes = Math.floor((timeDifference % (1000 * 60 * 60)) / (1000 * 60));
  const seconds = Math.floor((timeDifference % (1000 * 60)) / 1000);

  row.querySelector(".countdown").textContent = `${days} يوم ${hours} ساعة ${minutes} دقيقة ${seconds} ثانية`;
}

function initialize() {
  events.forEach(event => {
    const row = document.createElement("tr");
    row.innerHTML = `
      <td>${event.date}</td>
      <td>${event.day}</td>
      <td>${event.name}</td>
      <td class="countdown">--:--:--</td>
    `;
    eventsBody.appendChild(row);

    setInterval(() => updateCountdown(row, event), 1000);
  });
}

initialize();
